Tarea 1: creación de bases de datos

In [1]:
import sqlite3
from faker import Faker
import os
import random

In [2]:
#eliminamos bases de datos existentes
db = ['UC_database.sqlite', 'UoE_database.sqlite', 'Combined_database.sqlite']


for file in db:
    try:
        if os.path.exists(file):
            os.remove(file)
            print(f"Deleted database file: {file}")
        else:
            print(f"Database file not found: {file}")
    except Exception as e:
        print(f"Error deleting database file {file}: {e}")

Deleted database file: UC_database.sqlite
Deleted database file: UoE_database.sqlite
Deleted database file: Combined_database.sqlite

In [3]:
#base de datos UC

conn_uc = sqlite3.connect('UC_database.sqlite')  
c_uc = conn_uc.cursor() 


c_uc.execute('''
    CREATE TABLE IF NOT EXISTS Curso (
        idCurso INTEGER PRIMARY KEY,
        titulo VARCHAR(45) NOT NULL,
        creditos INTEGER NOT NULL
    )
''')
c_uc.execute('''
    CREATE TABLE IF NOT EXISTS Estudiante_has_Curso (
        Estudiante_idEstudiante INTEGER,
        Curso_idCurso INTEGER,
        PRIMARY KEY (Estudiante_idEstudiante, Curso_idCurso),
        FOREIGN KEY (Estudiante_idEstudiante) REFERENCES Estudiante(idEstudiante),
        FOREIGN KEY (Curso_idCurso) REFERENCES Curso(idCurso)
    )
''')
c_uc.execute('''
    CREATE TABLE  IF NOT EXISTS Estudiante (
        idEstudiante INTEGER PRIMARY KEY,
        nombre VARCHAR(25) NOT NULL,
        apellidos VARCHAR(85) NOT NULL,
        numMatricula VARCHAR(15),
        direccion VARCHAR(100),
        telefono VARCHAR(15),
        email VARCHAR(45)
    )
''')
c_uc.execute('''
    CREATE TABLE IF NOT EXISTS Profesor (
        idProfesor INTEGER PRIMARY KEY,
        nombre VARCHAR(25) NOT NULL,
        apellidos VARCHAR(85) NOT NULL,
        email VARCHAR(45)
    )
''')

c_uc.execute('''
    CREATE TABLE IF NOT EXISTS Profesor_has_Curso (
        Profesor_idProfesor INTEGER,
        Curso_idCurso INTEGER,
        PRIMARY KEY (Profesor_idProfesor, Curso_idCurso),
        FOREIGN KEY (Profesor_idProfesor) REFERENCES Profesor(idProfesor),
        FOREIGN KEY (Curso_idCurso) REFERENCES Curso(idCurso)
    )
''')
c_uc.execute('''
    CREATE TABLE IF NOT EXISTS EstudianteErasmus (
        idEstudianteErasmus INT,
        idEstudiante INT,
        universidadOrigen VARCHAR(45),
        PRIMARY KEY (idEstudiante, idEstudianteErasmus),
        FOREIGN KEY (idEstudiante) REFERENCES Estudiante(idEstudiante)
    )
''')
conn_uc.commit()
conn_uc.close()

In [4]:
# Base de datos UoE

conn_uoe = sqlite3.connect('UoE_database.sqlite')
c_uoe = conn_uoe.cursor()


c_uoe.execute('''
    CREATE TABLE IF NOT EXISTS Program (
        idProgram INTEGER PRIMARY KEY,
        name VARCHAR(45) NOT NULL,
        ueFees INTEGER,
        overseasFees VARCHAR(45)
    )
''')
c_uoe.execute('''
    CREATE TABLE IF NOT EXISTS SportActivity (
        idSportActivity INTEGER PRIMARY KEY,
        name VARCHAR(45) NOT NULL,
        durationWeeks INTEGER NOT NULL,
        price INTEGER NOT NULL
    )
''')
c_uoe.execute('''
    CREATE TABLE IF NOT EXISTS Student (
        idStudent INTEGER PRIMARY KEY,
        name VARCHAR(155) NOT NULL,
        dateOfBirth DATE NOT NULL,
        nationality VARCHAR(45),
        isErasmus BOOLEAN,
        homeUniversity VARCHAR(45),
        hasScolarship BOOLEAN,
        Program_idProgram INTEGER,
        englishLevel CHAR(2),
        SportActivity_idSportActivity INTEGER,
        FOREIGN KEY (Program_idProgram) REFERENCES Program(idProgram),
        FOREIGN KEY (SportActivity_idSportActivity) REFERENCES SportActivity(idSportActivity)
    )
''')
c_uoe.execute('''
    CREATE TABLE IF NOT EXISTS Subject (
        idSubject INTEGER NOT NULL,
        name VARCHAR(45) NOT NULL,
        year INTEGER,
        Program_idProgram INTEGER,
        PRIMARY KEY(idSubject),
        FOREIGN KEY (Program_idProgram) REFERENCES Program(idProgram)
    )
''')
c_uoe.execute('''
    CREATE TABLE IF NOT EXISTS StudentMarks (
        Student_idStudent INTEGER,
        Subject_idSubject INTEGER,
        mark INTEGER NOT NULL,
        PRIMARY KEY (Student_idStudent, Subject_idSubject),
        FOREIGN KEY (Student_idStudent) REFERENCES Student(idStudent),
        FOREIGN KEY (Subject_idSubject) REFERENCES Subject(idSubject)
    )
''')
conn_uoe.commit()
conn_uoe.close()

Tarea 2: inserción de datos artificiales en las bases de datos

In [5]:
fake = Faker()
fakeEs = Faker("es_ES")

In [6]:
#uc
conn_uc = sqlite3.connect('UC_database.sqlite')
c_uc = conn_uc.cursor()


for idProfesor in range(10):   
    nombre = fakeEs.first_name()
    apellidos = fakeEs.last_name()
    email = fakeEs.email()

    c_uc.execute('''
        INSERT INTO Profesor (idProfesor, nombre, apellidos, email) VALUES (?, ?, ?, ?)''',
        (idProfesor,nombre, apellidos, email))

#tabla estudiantes: insertamos primero 10 alumnos erasmus
for idEstudiante in range(10): 
    nombre = fake.first_name()
    apellidos = fake.last_name()
    numMatricula = fake.random_number(digits=8)
    direccion = fake.address()
    telefono = fake.phone_number()
    email = fake.email()

    c_uc.execute('''
        INSERT INTO Estudiante (idEstudiante,nombre, apellidos, numMatricula, direccion, telefono, email)
        VALUES (?, ?, ?, ?, ?, ?, ?)
    ''', (idEstudiante, nombre, apellidos, numMatricula, direccion, telefono, email))

#tabla estudiantes: insertamos primero 90 alumnos españoles
for idEstudiante in range(11,100): 
    nombre = fakeEs.first_name()
    apellidos = fakeEs.last_name()
    numMatricula = fakeEs.random_number(digits=8)
    direccion = fakeEs.address()
    telefono = fakeEs.phone_number()
    email = fakeEs.email()

    c_uc.execute('''
        INSERT INTO Estudiante (idEstudiante,nombre, apellidos, numMatricula, direccion, telefono, email)
        VALUES (?, ?, ?, ?, ?, ?, ?)
    ''', (idEstudiante, nombre, apellidos, numMatricula, direccion, telefono, email))



for idCurso in range(20):  
    titulo = fakeEs.word()
    creditos = fakeEs.random_int(min=2, max=6)

    c_uc.execute('''
        INSERT INTO Curso (idCurso,titulo, creditos)
        VALUES (?, ?,?)
    ''', (idCurso,titulo, creditos))


for estudiante_idEstudiante in range(100):   
    Curso_idCurso = fakeEs.random_int(min=0, max=19)
    c_uc.execute('''
        INSERT INTO Estudiante_has_Curso (Curso_idCurso, Estudiante_idEstudiante)
        VALUES (?, ?)
    ''', (Curso_idCurso, estudiante_idEstudiante))

for Profesor_idProfesor in range(10):   
    Curso_idCurso = fakeEs.random_int(min=0, max=19)
    c_uc.execute('''
        INSERT INTO Profesor_has_Curso (Profesor_idProfesor, Curso_idCurso)
            VALUES (?, ?)
        ''', (Profesor_idProfesor, Curso_idCurso))


for idEstudiante in range(10):  
    universidadOrigen = fake.city()
    idEstudianteErasmus = idEstudiante
    c_uc.execute('''
        INSERT INTO EstudianteErasmus (idEstudianteErasmus, idEstudiante, universidadOrigen)
        VALUES (?, ?,?)
    ''', (idEstudianteErasmus, idEstudiante, universidadOrigen))


conn_uc.commit()
conn_uc.close()

In [7]:
#UoE
conn_uoe = sqlite3.connect('UoE_database.sqlite')
c_uoe = conn_uoe.cursor()


for idStudent in range(100): 
    name = fake.name()
    dateOfBirth = fake.date()
    nationality = fake.country()
    isErasmus = random.choice([True, False])
    if isErasmus:
        homeUniversity = fake.city()
    else:
        homeUniversity = "Edinburg"
    hasScolarship = random.choice([True, False])
    Program_idProgram = random.randint(0, 29)
    englishLevel = random.choice(["a1","a2","b1","b2","c1","c2"])
    SportActivity_idSportActivity = random.randint(0, 9)

    c_uoe.execute('''
        INSERT INTO Student (idStudent,name,dateOfBirth,nationality,
        isErasmus,homeUniversity,hasScolarship,Program_idProgram,
        englishLevel,SportActivity_idSportActivity)
        VALUES (?, ?, ?, ?, ?, ?, ?, ?,?,?)
    ''', (idStudent,name,dateOfBirth,nationality,
        isErasmus,homeUniversity,hasScolarship,Program_idProgram,
        englishLevel,SportActivity_idSportActivity))


for idSubject in range(20):  
    name = fake.word()
    year = fake.random_int(min=1, max=4)
    Program_idProgram = random.randint(0, 29)

    c_uoe.execute('''
        INSERT INTO Subject (idSubject,name,year,Program_idProgram)
        VALUES (?, ?,?,?)
    ''',  (idSubject,name,year,Program_idProgram))


for Student_idStudent in range(100):   
    Subject_idSubject = random.randint(0, 19)
    mark = random.randint(0, 10)
    c_uoe.execute('''
        INSERT INTO StudentMarks (Student_idStudent,Subject_idSubject,mark)
        VALUES (?, ?,?)
    ''', (Student_idStudent,Subject_idSubject,mark))



for idSportActivity in range(10):   
    name = fake.word()
    durationWeeks = random.randint(1, 36)
    price = random.randint(0, 100)
    c_uoe.execute('''
        INSERT INTO SportActivity (idSportActivity,name,durationWeeks,price)
            VALUES (?, ?,?,?)
        ''', (idSportActivity,name,durationWeeks,price))


for idProgram in range(30):   
    name = fake.word()
    ueFees = random.randint(0, 50)
    overseasFees = random.randint(0, 100)
    c_uoe.execute('''
        INSERT INTO Program (idProgram,name,ueFees,overseasFees)
            VALUES (?, ?, ?, ?)
        ''', (idProgram,name,ueFees,overseasFees))

conn_uoe.commit()
conn_uoe.close()

Tarea 3: creación de la base de datos integrada. 

Teniendo en cuenta la estructura de ambas bases de datos, las tablas "curso", "estudiante_has_curso" y "estudiante" de la base de UC se mantienen y amplian con los campos de "Subject","EstudentMarks" y "Student" de la base de UoE. A partir de estas tablas, se agregan otras de forma que no se pierda información de ninguna de las bases de datos originales.

In [8]:
#base de datos integrada

conn_comb = sqlite3.connect('Combined_database.sqlite')  
c_comb = conn_comb.cursor() 


c_comb.execute('''
    CREATE TABLE IF NOT EXISTS Curso (
        idUni INTEGER,
        idCurso INTEGER,
        titulo VARCHAR(45) NOT NULL,
        anno INTEGER,
        creditos INTEGER,
        Programa_idPrograma INTEGER,
        PRIMARY KEY(idUni,idCurso)
        FOREIGN KEY (Programa_idPrograma) REFERENCES Programa(idPrograma))''')
c_comb.execute('''
    CREATE TABLE IF NOT EXISTS Estudiante_has_Curso (
        idUni INTEGER,
        Estudiante_idEstudiante INTEGER,
        Curso_idCurso INTEGER,
        nota INTEGER,
        PRIMARY KEY (idUni, Estudiante_idEstudiante, Curso_idCurso),
        FOREIGN KEY (Estudiante_idEstudiante) REFERENCES Estudiante(idEstudiante),
        FOREIGN KEY (Curso_idCurso) REFERENCES Curso(idCurso)
    )
''')
c_comb.execute('''
    CREATE TABLE  IF NOT EXISTS Estudiante (
        idUni INTEGER,
        idEstudiante INTEGER,
        fechaDeNacimiento DATE,
        nacionalidad VARCHAR(85),
        nombre VARCHAR(25) NOT NULL,
        apellidos VARCHAR(85),
        tieneBeca BOOLEAN,
        numMatricula VARCHAR(15),
        direccion VARCHAR(100),
        telefono VARCHAR(15),
        email VARCHAR(45),
        Programa_idPrograma INTEGER,
        nivelIngles CHAR(2),
        Deporte_idDeporte INTEGER,
        PRIMARY KEY (idUni ,idEstudiante),
        FOREIGN KEY (Programa_idPrograma) REFERENCES Programa(idPrograma),
        FOREIGN KEY (Deporte_idDeporte) REFERENCES Deporte(idDeporte)        
    )
''')

#tabla solo usada para UC, por lo que no hace falta distinguir entre
#profesores de varias universidades. idProfesor se refiere al profesor
#cuyo idUni seria el id de UC.
c_comb.execute('''
    CREATE TABLE IF NOT EXISTS Profesor (
        idProfesor INTEGER PRIMARY KEY,
        nombre VARCHAR(25) NOT NULL,
        apellidos VARCHAR(85) NOT NULL,
        email VARCHAR(45)
    )
''')

#de la misma forma, no distinguimos los cursos asociados a profesores 
#son solo de la UC por lo que no incluimos idUni
c_comb.execute('''
    CREATE TABLE IF NOT EXISTS Profesor_has_Curso (
        Profesor_idProfesor INTEGER,
        Curso_idCurso INTEGER,
        PRIMARY KEY (Profesor_idProfesor, Curso_idCurso),
        FOREIGN KEY (Profesor_idProfesor) REFERENCES Profesor(idProfesor),
        FOREIGN KEY (Curso_idCurso) REFERENCES Curso(idCurso)
    )
''')
c_comb.execute('''
    CREATE TABLE IF NOT EXISTS EstudianteErasmus (
        idUni INT,
        idEstudianteErasmus INT,
        idEstudiante INT,
        universidadOrigen VARCHAR(45),
        PRIMARY KEY (idUni,idEstudiante, idEstudianteErasmus),
        FOREIGN KEY (idEstudiante) REFERENCES Estudiante(idEstudiante)
    )
''')
#de la misma forma, el idPrograma solo corresponde a programas con idUni
# el de UoE
c_comb.execute('''
    CREATE TABLE IF NOT EXISTS Programa (
        idPrograma INTEGER PRIMARY KEY,
        nombre VARCHAR(45) NOT NULL,
        TarifaUE INTEGER,
        TarifaNoUE VARCHAR(45)
    )
''')
c_comb.execute('''
    CREATE TABLE IF NOT EXISTS Deporte (
        idDeporte INTEGER PRIMARY KEY,
        nombre VARCHAR(45) NOT NULL,
        semanas INTEGER NOT NULL,
        precio INTEGER NOT NULL
    )
''')

conn_comb.commit()
conn_comb.close()

Tarea 4: extracción, transformación y carga de los datos originales en  la base de datos integrada

In [9]:
#Extracción

def extraccion(database_file):
    # extrae las tablas de una base de datos en forma de un diccionario
  
    conn = sqlite3.connect(database_file)
    c = conn.cursor()

    c.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tables = c.fetchall()
    
    
    dictExtr = {}


    for table in tables:
        table_name = table[0]
        c.execute(f"SELECT * FROM {table_name};")
        table_data = c.fetchall()
        dictExtr[table_name] = table_data

    # Cerrar la conexión
    conn.close()

    return dictExtr

In [10]:
dictUc = extraccion('UC_database.sqlite')

In [11]:
dictUoE = extraccion('UoE_database.sqlite')

In [12]:
#Transformación e inserción
#UC a combined

conn = sqlite3.connect('Combined_database.sqlite')
c = conn.cursor()
idUni = [1]


#Estudiante
for elemento in dictUc["Estudiante"]:  
    fila = list(elemento)
    #insertamos None en campos no definidos para UC
    fila[0:0] =  idUni
    fila[2:2] =  [None] * 2
    fila[6:6] =  [None] * 1
    fila[11:11] =  [None] * 3
    fila = tuple(fila)
    c.execute('''
        INSERT INTO Estudiante (idUni,idEstudiante,fechaDeNacimiento,
        nacionalidad,nombre,apellidos,tieneBeca,numMatricula,direccion,
        telefono,email,Programa_idPrograma,nivelIngles,Deporte_idDeporte)
        VALUES (?, ?,?,?,?, ?,?,?,?, ?,?,?,?,?)
    ''', fila)

#Curso
for elemento in dictUc["Curso"]:
    fila = list(elemento)
    #insertamos None en campos no definidos para UC
    fila[0:0] =  idUni
    fila[3:3] =  [None] * 1
    fila[5:5] =  [None] * 1
    fila = tuple(fila)
    c.execute('''
        INSERT INTO Curso (idUni,idCurso,titulo,anno,creditos,Programa_idPrograma)
        VALUES (?,?,?,?,?,?)
    ''', fila)

#Estudiante_has_Curso
for elemento in dictUc["Estudiante_has_Curso"]:  
    fila = list(elemento)
    #insertamos None en campos no definidos para UC
    fila[0:0] =  idUni
    fila[3:3] =  [None] * 1
    fila = tuple(fila)
    c.execute('''
        INSERT INTO Estudiante_has_Curso (idUni,Estudiante_idEstudiante,Curso_idCurso,nota)
        VALUES (?, ?,?,?)
    ''', fila)
#Profesor
for elemento in dictUc["Profesor"]:   
    c.execute('''
        INSERT INTO Profesor (idProfesor,nombre,apellidos,email)
        VALUES (?, ?,?,?)
    ''', elemento)
#Profesor_has_Curso
for elemento in dictUc["Profesor_has_Curso"]:   
    c.execute('''
        INSERT INTO Profesor_has_Curso (Profesor_idProfesor,Curso_idCurso)
        VALUES (?, ?)
    ''', elemento)
#EstudianteErasmus
for elemento in dictUc["EstudianteErasmus"]:  
    fila = list(elemento)
    #insertamos None en campos no definidos para UC
    fila[0:0] =  idUni
    fila = tuple(fila)
    c.execute('''
        INSERT INTO EstudianteErasmus (idUni,idEstudianteErasmus,idEstudiante,universidadOrigen)
        VALUES (?,?,?,?)
    ''', fila)

conn.commit()
conn.close()

In [13]:
#Transformación e inserción
#UoE a combined

conn = sqlite3.connect('Combined_database.sqlite')
c = conn.cursor()
idUni = [2]


#Estudiante
for elemento in dictUoE["Student"]:  
    fila = list(elemento)
    #las filas de la tabla Student de UoE tienen loos campos
    #en otro orden por lo que hay que hacer un cambio antes
    #de volcarlos a la base de datos combinada
    #insertamos None en campos no definidos para UoE
    
    fila[0:0] =  idUni
    #fechaNacimiento en tercerlugar
    nacionalidad = fila[4]
    fila[4:4] = [fila[2]]
    fila[2] = fila[3]
    fila.pop(3)
    #nacionalidad en cuarto lugar
    fila[3:3] = [nacionalidad]
    fila.pop(5)
    
    #fila[4] = fila[3]
    #fila.pop(4)
    
    fila[5:5]= [None]
    #tiene beca
    fila[6] = fila[8]
    fila.pop(8)
    #NumMat
    fila[7]= None
    #otros
    fila[8:8]=[None] * 3
    
    
    fila = tuple(fila)
    c.execute('''
        INSERT INTO Estudiante (idUni,idEstudiante,fechaDeNacimiento,
        nacionalidad,nombre,apellidos,tieneBeca,numMatricula,direccion,
        telefono,email,Programa_idPrograma,nivelIngles,Deporte_idDeporte)
        VALUES (?, ?,?,?,?, ?,?,?,?, ?,?,?,?,?)
    ''', fila)

#Curso
for elemento in dictUoE["Subject"]:
    fila = list(elemento)
    #insertamos None en campos no definidos para UC
    fila[0:0] =  idUni
    fila[4:4] =  [None] 
    fila = tuple(fila)
    c.execute('''
        INSERT INTO Curso (idUni,idCurso,titulo,anno,creditos,Programa_idPrograma)
        VALUES (?,?,?,?,?,?)
    ''', fila)

#Estudiante_has_Curso
for elemento in dictUoE["StudentMarks"]:  
    fila = list(elemento)
    #insertamos None en campos no definidos para UC
    fila[0:0] =  idUni
    fila = tuple(fila)
    c.execute('''
        INSERT INTO Estudiante_has_Curso (idUni,Estudiante_idEstudiante,Curso_idCurso,nota)
        VALUES (?, ?,?,?)
    ''', fila)


#Programa
for elemento in dictUoE["Program"]:   
    c.execute('''
        INSERT INTO Programa (idPrograma,nombre,TarifaUE,TarifaNoUE)
        VALUES (?,?,?,?)
    ''', elemento)
i = 0
for elemento in dictUoE["Student"]:  
    #recorremos la tabla student para ver cuales son erasmus con el campo isErasmus
    if elemento[4]:
        fila = list(elemento)
        fila = fila[:4]
        fila[0] =  2
        #como idEstudianteErasmus forma parte de la PK de la tabla, añadimos un valor
        #por orden de inserción
        fila[1] = i
        i = i+1
        #idEstudiante
        fila[2] = elemento[0]
        #universidadOrigen
        fila[3] = elemento[5]
        fila = tuple(fila)
        c.execute('''
            INSERT INTO EstudianteErasmus (idUni,idEstudianteErasmus,idEstudiante,universidadOrigen)
            VALUES (?,?,?,?)
        ''', fila)
for elemento in dictUoE["SportActivity"]:   
    c.execute('''
        INSERT INTO Deporte (idDeporte,nombre,semanas,precio)
        VALUES (?,?,?,?)
    ''', elemento)

conn.commit()
conn.close()

In [14]:
#consulta de prueba
conn = sqlite3.connect('Combined_database.sqlite')
c = conn.cursor()
print("deportes")
deporte = c.execute('''SELECT * from Deporte''')
for d in deporte:
    print(d)

print("estudiantes")
estudiantes = c.execute('''SELECT * from Estudiante''')
for e in estudiantes:
    print(e)

conn.commit()
conn.close()

deportes
(0, 'art', 6, 15)
(1, 'something', 13, 67)
(2, 'trial', 9, 3)
(3, 'worry', 17, 36)
(4, 'office', 26, 24)
(5, 'message', 5, 81)
(6, 'rich', 5, 22)
(7, 'special', 26, 40)
(8, 'choice', 20, 19)
(9, 'teacher', 3, 37)
estudiantes
(1, 0, None, None, 'Christopher', 'Stewart', None, '98078855', '292 Jerry Wells Suite 858\nCharleschester, MH 44003', '001-349-224-7832', 'edwardsgregory@example.com', None, None, None)
(1, 1, None, None, 'Michelle', 'Pearson', None, '75668312', '27661 Buckley Wall Suite 673\nJeffreybury, ME 73423', '255.283.2126x06280', 'ruthbrown@example.com', None, None, None)
(1, 2, None, None, 'Ryan', 'Ross', None, '65888482', '35746 Charles Islands Suite 676\nMartinezchester, AZ 20852', '6524035579', 'otaylor@example.net', None, None, None)
(1, 3, None, None, 'Jessica', 'Calhoun', None, '63860870', '80449 Wong Harbors\nNorth Matthewtown, HI 17764', '(931)690-8749x304', 'romerodavid@example.com', None, None, None)
(1, 4, None, None, 'Bailey', 'Carter', None, '17811630', '7044 Lisa Drive\nSouth Joshua, MS 02394', '001-966-954-2459', 'cortiz@example.net', None, None, None)
(1, 5, None, None, 'Theresa', 'Burns', None, '67074524', '771 Williamson Underpass\nBrucemouth, PW 22710', '451-810-2369x460', 'franklinnancy@example.com', None, None, None)
(1, 6, None, None, 'Kyle', 'Christensen', None, '56164847', '053 William Spur\nThomasbury, MA 73890', '(942)207-4913x23169', 'jacob92@example.net', None, None, None)
(1, 7, None, None, 'Kelly', 'Franklin', None, '24597911', '111 Hunter Knoll\nPort Jasmine, OR 08854', '885-866-4815x3340', 'cameroncrane@example.org', None, None, None)
(1, 8, None, None, 'David', 'Williams', None, '24443783', '3458 Grant Ferry Suite 402\nWest Kristen, IN 01831', '001-552-361-6505x53418', 'fbrown@example.com', None, None, None)
(1, 9, None, None, 'Sarah', 'Mullins', None, '54829860', '6948 Kristina Islands\nMooremouth, PR 47197', '911-773-5429x9993', 'travis25@example.net', None, None, None)
(1, 11, None, None, 'Flavio', 'Borrell', None, '68963148', 'Urbanización Febe Serrano 70\nTeruel, 17967', '+34 731177914', 'llabresester@example.com', None, None, None)
(1, 12, None, None, 'Maxi', 'Leiva', None, '48126962', 'Plaza de Encarnacion Ros 924 Piso 1 \nVizcaya, 39478', '+34849 980 672', 'castejonursula@example.com', None, None, None)
(1, 13, None, None, 'Palmira', 'Vall', None, '70560415', 'Urbanización Marcela Feijoo 50 Apt. 61 \nCuenca, 06364', '+34 702 12 14 62', 'cverdu@example.net', None, None, None)
(1, 14, None, None, 'Aránzazu', 'Roig', None, '31114467', 'Ronda de Jafet Roma 39 Piso 1 \nMálaga, 41791', '+34921317972', 'jafet30@example.net', None, None, None)
(1, 15, None, None, 'Sigfrido', 'Talavera', None, '2573218', 'Camino de María Jesús Laguna 7 Piso 5 \nMelilla, 14986', '+34931 822 744', 'gayaadalberto@example.com', None, None, None)
(1, 16, None, None, 'Noelia', 'Córdoba', None, '95249729', 'Callejón de Trinidad Clavero 76 Apt. 02 \nÁvila, 14023', '+34847 156 984', 'xsaenz@example.com', None, None, None)
(1, 17, None, None, 'Pascual', 'Aranda', None, '90205305', 'Calle de Victorino Pujadas 617\nMurcia, 35095', '+34705 99 37 83', 'solislope@example.net', None, None, None)
(1, 18, None, None, 'Marita', 'Lillo', None, '22813587', 'Cuesta de Jorge Escalona 9\nLugo, 25312', '+34980 064 260', 'marinfabian@example.com', None, None, None)
(1, 19, None, None, 'Tania', 'Fernandez', None, '11624728', 'Vial Poncio Cal 813\nBurgos, 24999', '+34857 47 39 38', 'fitocozar@example.net', None, None, None)
(1, 20, None, None, 'Nazario', 'Morcillo', None, '84540668', 'Camino de Juanita Arnau 35 Piso 2 \nCuenca, 31089', '+34887857948', 'vilma71@example.com', None, None, None)
(1, 21, None, None, 'Nilda', 'Clemente', None, '22834843', 'Calle Crescencia Llorens 10 Apt. 71 \nSoria, 40590', '+34844 156 123', 'ylucena@example.net', None, None, None)
(1, 22, None, None, 'Martina', 'Antúnez', None, '50181716', 'Ronda de Samanta Palomino 18\nPalencia, 04693', '+34 886 402 864', 'guiomarvina@example.net', None, None, None)
(1, 23, None, None, 'Nazario', 'Castell', None, '41767857', 'Camino Darío Múñiz 94\nCuenca, 15480', '+34825515506', 'jaumecesar@example.org', None, None, None)
(1, 24, None, None, 'Borja', 'Comas', None, '62126061', 'Camino Pastora Palmer 32 Apt. 32 \nCáceres, 36506', '+34927 84 16 45', 'benitezmarisol@example.com', None, None, None)
(1, 25, None, None, 'Javiera', 'Almazán', None, '10675837', 'Ronda María Teresa Nicolau 19 Apt. 24 \nGranada, 31775', '+34 946 065 581', 'blazquezimelda@example.com', None, None, None)
(1, 26, None, None, 'Marcela', 'Salcedo', None, '25055120', 'Glorieta de Herminio Ferreras 93 Piso 5 \nGuipúzcoa, 18616', '+34987638930', 'edgar49@example.com', None, None, None)
(1, 27, None, None, 'Leocadio', 'Azorin', None, '34572301', 'Acceso de Claudia Cases 96\nNavarra, 14019', '+34 872789493', 'lgabaldon@example.net', None, None, None)
(1, 28, None, None, 'Baudelio', 'Carreño', None, '34866677', 'Via de Alejandro Lerma 78 Puerta 7 \nPontevedra, 25278', '+34713 670 181', 'armengoleligio@example.com', None, None, None)
(1, 29, None, None, 'Elisabet', 'Botella', None, '11360033', 'Acceso Milagros Cabeza 3 Piso 0 \nLas Palmas, 33058', '+34924 04 85 96', 'maximiralles@example.com', None, None, None)
(1, 30, None, None, 'Emiliano', 'Casas', None, '19223763', 'Cañada Azahar Mora 37 Puerta 0 \nSegovia, 30644', '+34978097754', 'martinabarral@example.org', None, None, None)
(1, 31, None, None, 'Sonia', 'Cabeza', None, '77078240', 'Acceso de Ágata Izquierdo 73\nOurense, 12263', '+34 983282517', 'verdejoguadalupe@example.org', None, None, None)
(1, 32, None, None, 'Belén', 'Torrijos', None, '86331158', 'Cuesta Pascuala Marquez 63 Piso 5 \nNavarra, 42801', '+34841058154', 'qperea@example.com', None, None, None)
(1, 33, None, None, 'Nidia', 'Tomás', None, '5062469', 'Cañada de Azeneth Saez 92 Piso 4 \nHuesca, 30389', '+34879 67 15 91', 'higuerasseve@example.net', None, None, None)
(1, 34, None, None, 'Ascensión', 'Villalobos', None, '63585784', 'Paseo de Marco Saura 819\nCádiz, 09427', '+34 828602441', 'royocalixta@example.org', None, None, None)
(1, 35, None, None, 'Julio', 'Fuente', None, '42399631', 'Via Emilia Calvet 39\nValencia, 16389', '+34971960139', 'arnaljuanito@example.org', None, None, None)
(1, 36, None, None, 'Teobaldo', 'Molina', None, '98802875', 'Rambla Buenaventura Pinto 289\nMelilla, 31142', '+34710 63 16 22', 'tania09@example.org', None, None, None)
(1, 37, None, None, 'Faustino', 'Caro', None, '92869429', 'Pasaje de José Manuel Guardiola 99 Apt. 00 \nBarcelona, 12337', '+34 888040161', 'quirinorivera@example.org', None, None, None)
(1, 38, None, None, 'Vasco', 'Arribas', None, '75898030', 'Glorieta Susanita Rodríguez 15\nSalamanca, 28633', '+34 983 04 99 29', 'josefinamarquez@example.com', None, None, None)
(1, 39, None, None, 'Amaro', 'Duque', None, '61608855', 'Via Patricia Diego 856\nGuadalajara, 01636', '+34977 75 46 38', 'fortunata43@example.org', None, None, None)
(1, 40, None, None, 'Rico', 'Ros', None, '68268639', 'Callejón Alonso Alonso 73 Piso 5 \nBadajoz, 34412', '+34917 52 83 62', 'amadavillegas@example.org', None, None, None)
(1, 41, None, None, 'Julia', 'Abellán', None, '4501720', 'Camino de Renato Quirós 85\nHuelva, 43119', '+34 954 051 496', 'leyre21@example.org', None, None, None)
(1, 42, None, None, 'Blas', 'Goñi', None, '53414167', 'Cañada Jordán Guardia 46\nMadrid, 46694', '+34 928 946 991', 'juliafabregat@example.net', None, None, None)
(1, 43, None, None, 'Bibiana', 'Pallarès', None, '9340591', 'Paseo de Alcides Pedraza 39 Piso 4 \nMurcia, 08511', '+34987 129 555', 'herreropaola@example.com', None, None, None)
(1, 44, None, None, 'Eligio', 'Camps', None, '24519330', 'Alameda Nicolás Escamilla 88\nSevilla, 48701', '+34 873 11 12 91', 'gracianafigueroa@example.net', None, None, None)
(1, 45, None, None, 'Samu', 'Montaña', None, '53588716', 'Calle de Jose Ignacio Ródenas 8\nCuenca, 10823', '+34806 17 85 19', 'romanchus@example.com', None, None, None)
(1, 46, None, None, 'Rebeca', 'Ferrer', None, '49323932', 'Glorieta de Eugenio Toledo 43\nAlicante, 45539', '+34803890504', 'moisespozuelo@example.net', None, None, None)
(1, 47, None, None, 'Efraín', 'Jimenez', None, '5016410', 'Cuesta de Marianela Morcillo 593 Puerta 6 \nToledo, 10445', '+34 985 15 50 99', 'calixta53@example.net', None, None, None)
(1, 48, None, None, 'Sarita', 'Gilabert', None, '56462381', 'Ronda de Felicidad Ferreras 49 Piso 0 \nCantabria, 20164', '+34880037629', 'pomaresmacaria@example.org', None, None, None)
(1, 49, None, None, 'Virgilio', 'Posada', None, '29131931', 'Alameda Leocadia Juan 13 Puerta 2 \nBarcelona, 26808', '+34722799333', 'carballoclemente@example.org', None, None, None)
(1, 50, None, None, 'Maricela', 'Lozano', None, '86555835', 'Paseo de Clímaco Vazquez 97 Puerta 8 \nMálaga, 44040', '+34927 949 054', 'marinomagdalena@example.com', None, None, None)
(1, 51, None, None, 'Adolfo', 'Arco', None, '47176630', 'Acceso de Natalio Julián 193\nBarcelona, 01171', '+34975 371 941', 'melendezaurelia@example.org', None, None, None)
(1, 52, None, None, 'Nando', 'Lamas', None, '40780112', 'Camino de Julio César Gascón 15\nValencia, 11420', '+34 986 404 740', 'salvadorolimpia@example.com', None, None, None)
(1, 53, None, None, 'Bartolomé', 'Alvarez', None, '9197298', 'Pasaje de Domingo Torrents 17 Apt. 33 \nCantabria, 50698', '+34 828 078 267', 'pprada@example.com', None, None, None)
(1, 54, None, None, 'Gertrudis', 'Hierro', None, '85839091', 'Ronda Epifanio Alsina 94\nLugo, 31402', '+34 880 71 45 22', 'federicobustamante@example.org', None, None, None)
(1, 55, None, None, 'Manolo', 'Muñoz', None, '68823606', 'C. de Gracia Priego 9\nMálaga, 04100', '+34 876 497 105', 'qamo@example.net', None, None, None)
(1, 56, None, None, 'Ambrosio', 'Moreno', None, '3027575', 'Camino de Fortunato Terrón 9\nCeuta, 47352', '+34821 986 477', 'roberta73@example.net', None, None, None)
(1, 57, None, None, 'Che', 'Guitart', None, '97007281', 'Rambla Úrsula Alarcón 9 Puerta 0 \nZaragoza, 20341', '+34 824 187 795', 'lucas69@example.net', None, None, None)
(1, 58, None, None, 'Ofelia', 'Olivé', None, '17352808', 'Pasadizo de Teófila Mayo 670 Piso 8 \nValladolid, 13102', '+34901 726 040', 'morelltere@example.com', None, None, None)
(1, 59, None, None, 'Benigno', 'Palomares', None, '12041828', 'Avenida de Luna Cuéllar 37\nLa Rioja, 34848', '+34 942 396 830', 'floraaranda@example.net', None, None, None)
(1, 60, None, None, 'José', 'Godoy', None, '36195930', 'Cuesta de Carolina Ortega 93 Piso 7 \nPalencia, 07192', '+34876 969 829', 'atiliomarti@example.net', None, None, None)
(1, 61, None, None, 'Araceli', 'Rosselló', None, '11205095', 'C. Lorenza Real 7\nAsturias, 05709', '+34 981 96 79 53', 'noliver@example.net', None, None, None)
(1, 62, None, None, 'Serafina', 'Paredes', None, '14277631', 'Avenida Gilberto Comas 29\nSegovia, 22057', '+34803 29 51 49', 'nilda79@example.org', None, None, None)
(1, 63, None, None, 'Reina', 'Yuste', None, '18312239', 'Pasadizo de Lorenza Barranco 80\nHuelva, 24251', '+34 825388512', 'ngutierrez@example.org', None, None, None)
(1, 64, None, None, 'Cipriano', 'Rey', None, '71286178', 'Glorieta María Carmen Montalbán 86\nSevilla, 10156', '+34 848 73 43 46', 'gregorioacuna@example.net', None, None, None)
(1, 65, None, None, 'Gaspar', 'Llanos', None, '66719677', 'Rambla Pilar Girón 588 Piso 7 \nÁvila, 41210', '+34972670920', 'paz71@example.net', None, None, None)
(1, 66, None, None, 'Cintia', 'Flores', None, '75829081', 'Alameda Apolonia Rocha 39 Piso 9 \nSoria, 22574', '+34873 177 104', 'solsonatomasa@example.com', None, None, None)
(1, 67, None, None, 'Reyes', 'Casares', None, '73530988', 'Callejón de Teodora Mármol 66 Piso 1 \nAlbacete, 11011', '+34946 144 543', 'basiliocarmona@example.org', None, None, None)
(1, 68, None, None, 'Jafet', 'Machado', None, '29594050', 'Vial de Sergio Otero 6 Piso 4 \nMadrid, 44870', '+34 925448086', 'sbernad@example.com', None, None, None)
(1, 69, None, None, 'Javi', 'Sola', None, '23743225', 'Acceso de Nando Avilés 39 Apt. 27 \nGirona, 29722', '+34828619247', 'ecampos@example.org', None, None, None)
(1, 70, None, None, 'Bartolomé', 'Cabello', None, '82965881', 'Callejón Mamen Cabello 56\nHuesca, 21330', '+34645533397', 'albertoescamilla@example.org', None, None, None)
(1, 71, None, None, 'Enrique', 'Redondo', None, '39329391', 'Via de Virginia Gómez 97\nCuenca, 19261', '+34925 598 742', 'arturoluz@example.net', None, None, None)
(1, 72, None, None, 'Ciríaco', 'Rodrigo', None, '95104658', 'Paseo Adelaida Perales 648\nAsturias, 27199', '+34708 56 19 39', 'gutierrezelena@example.net', None, None, None)
(1, 73, None, None, 'Paz', 'Rosales', None, '93259264', 'Paseo de Aránzazu Grande 72 Apt. 05 \nLleida, 37739', '+34874336451', 'bernadjulian@example.net', None, None, None)
(1, 74, None, None, 'Rosario', 'Novoa', None, '96702577', 'Urbanización de Hernán Pellicer 12\nPontevedra, 22986', '+34823 070 836', 'lcalvo@example.com', None, None, None)
(1, 75, None, None, 'Juan Antonio', 'Barrios', None, '68493928', 'Camino Encarnación Castellanos 63\nCáceres, 01261', '+34 983 915 945', 'verdejotelmo@example.net', None, None, None)
(1, 76, None, None, 'Pascual', 'Escobar', None, '57525874', 'Calle Jafet Mas 783 Puerta 0 \nAlbacete, 20907', '+34 807736751', 'emilianosandoval@example.com', None, None, None)
(1, 77, None, None, 'Ramón', 'Roselló', None, '78649985', 'Via de Feliciano Sierra 45\nGuipúzcoa, 18322', '+34817 235 014', 'bartolomevasco@example.org', None, None, None)
(1, 78, None, None, 'Salomón', 'Giménez', None, '39633540', 'Calle Victor Manuel Espejo 36\nLleida, 12370', '+34885662188', 'climacojorda@example.net', None, None, None)
(1, 79, None, None, 'Elpidio', 'Alcázar', None, '3440616', 'Calle Ulises Azorin 2 Puerta 9 \nValladolid, 49594', '+34844 03 64 56', 'ortunochuy@example.org', None, None, None)
(1, 80, None, None, 'Alfonso', 'Villanueva', None, '97924648', 'Camino de Gerónimo Lluch 1\nTarragona, 23521', '+34976 76 53 29', 'elpidio01@example.net', None, None, None)
(1, 81, None, None, 'Felipa', 'Carro', None, '95589700', 'C. Manuelita Mata 68\nCantabria, 05889', '+34812 517 200', 'dionisiabellido@example.com', None, None, None)
(1, 82, None, None, 'Quique', 'Varela', None, '60575115', 'Acceso de Amarilis Andrés 25 Piso 8 \nJaén, 26958', '+34922 12 34 50', 'xnicolas@example.org', None, None, None)
(1, 83, None, None, 'Benito', 'Jódar', None, '89016518', 'Cañada Óscar Torrents 6\nSalamanca, 28797', '+34976 72 53 10', 'antonio31@example.org', None, None, None)
(1, 84, None, None, 'Domitila', 'Fortuny', None, '12327399', 'Rambla de Manu Heredia 20 Apt. 46 \nAlicante, 27071', '+34927170494', 'cayetanoreig@example.org', None, None, None)
(1, 85, None, None, 'Sosimo', 'Uriarte', None, '62986400', 'Paseo de Alejo Zabaleta 81 Piso 4 \nToledo, 51949', '+34 925 59 36 17', 'belen14@example.net', None, None, None)
(1, 86, None, None, 'José Ángel', 'Barreda', None, '32360869', 'Callejón Fanny Pol 39 Puerta 9 \nCeuta, 37017', '+34 806793443', 'pmontana@example.net', None, None, None)
(1, 87, None, None, 'Celestina', 'Niño', None, '74626383', 'Cañada Rosalva Naranjo 73\nJaén, 41436', '+34 984 03 62 15', 'natalio28@example.net', None, None, None)
(1, 88, None, None, 'Baudelio', 'Corral', None, '33674934', 'Avenida de Gilberto Iglesias 79\nBaleares, 24727', '+34 834 93 94 81', 'modestaramos@example.net', None, None, None)
(1, 89, None, None, 'Felipa', 'Manso', None, '89416090', 'Rambla Pepita Hervás 63\nNavarra, 38170', '+34 848802000', 'uriartebuenaventura@example.net', None, None, None)
(1, 90, None, None, 'Silvestre', 'Borrego', None, '66511022', 'Pasaje Rebeca Batlle 34 Apt. 67 \nAlbacete, 09720', '+34988 337 830', 'pepito63@example.org', None, None, None)
(1, 91, None, None, 'Amando', 'Barreda', None, '25012700', 'Via Juliana Matas 1 Apt. 88 \nGranada, 38690', '+34 957066039', 'adelaida11@example.com', None, None, None)
(1, 92, None, None, 'Emelina', 'Espinosa', None, '97916800', 'Urbanización de Jonatan Mata 94 Piso 3 \nBarcelona, 14324', '+34976128012', 'barredamanu@example.org', None, None, None)
(1, 93, None, None, 'Antonia', 'Céspedes', None, '65978816', 'Pasaje de Elba Almazán 55\nGranada, 01128', '+34984 444 446', 'gordillojose-carlos@example.net', None, None, None)
(1, 94, None, None, 'Eusebia', 'Perera', None, '47471439', 'Pasadizo de Pepita Alegria 72\nMálaga, 09475', '+34 803302267', 'jimenezsamanta@example.org', None, None, None)
(1, 95, None, None, 'Nieves', 'Gárate', None, '83301330', 'Paseo Isaac Hurtado 81\nZamora, 48902', '+34834 657 728', 'lermacoral@example.com', None, None, None)
(1, 96, None, None, 'Lope', 'Mayo', None, '77938618', 'Alameda de Jenny Ribas 9\nLa Coruña, 41972', '+34877 884 940', 'blazqueznicolas@example.net', None, None, None)
(1, 97, None, None, 'Jenaro', 'Casas', None, '3107296', 'C. Teófilo Taboada 1\nMadrid, 36194', '+34 943427580', 'qpelaez@example.org', None, None, None)
(1, 98, None, None, 'Juan Bautista', 'Huertas', None, '528870', 'Pasaje de Alcides Borrego 91 Apt. 81 \nCantabria, 48362', '+34 986 133 388', 'mvera@example.net', None, None, None)
(1, 99, None, None, 'Eleuterio', 'Sancho', None, '71336084', 'Paseo José María Valentín 51 Piso 0 \nLleida, 27404', '+34 987939144', 'arsenio91@example.net', None, None, None)
(2, 0, '1972-04-23', 'United Arab Emirates', 'Jennifer Sanders', None, 0, None, None, None, None, 17, 'a1', 0)
(2, 1, '1990-07-16', 'Liechtenstein', 'Mr. Scott Jones', None, 1, None, None, None, None, 11, 'c2', 4)
(2, 2, '1981-11-01', 'Tuvalu', 'Melissa Dawson', None, 0, None, None, None, None, 14, 'b2', 5)
(2, 3, '1999-02-17', 'Ukraine', 'David Cook', None, 0, None, None, None, None, 11, 'a2', 0)
(2, 4, '2009-09-12', 'Burkina Faso', 'Kevin Davis', None, 0, None, None, None, None, 18, 'b2', 0)
(2, 5, '2019-08-06', 'Lithuania', 'Stanley Santiago', None, 0, None, None, None, None, 11, 'a1', 3)
(2, 6, '2012-10-02', 'United Kingdom', 'Jennifer Williams', None, 0, None, None, None, None, 22, 'b2', 6)
(2, 7, '1983-01-26', 'Puerto Rico', 'Mark Cole', None, 1, None, None, None, None, 8, 'c2', 3)
(2, 8, '1991-07-07', 'Chile', 'Megan Morris', None, 0, None, None, None, None, 20, 'c2', 0)
(2, 9, '2023-02-12', 'Guinea-Bissau', 'Darren Hurst', None, 0, None, None, None, None, 14, 'b2', 7)
(2, 10, '1979-11-14', 'Afghanistan', 'William Sheppard', None, 1, None, None, None, None, 15, 'a1', 4)
(2, 11, '1980-10-09', 'Denmark', 'Stacy Thompson', None, 1, None, None, None, None, 6, 'a1', 2)
(2, 12, '2010-09-12', 'Bahrain', 'Brian Cummings', None, 1, None, None, None, None, 10, 'c1', 5)
(2, 13, '2010-05-10', 'Hong Kong', 'Zoe Bryant', None, 1, None, None, None, None, 21, 'b1', 3)
(2, 14, '2000-11-15', 'Guatemala', 'Joseph Powell', None, 1, None, None, None, None, 12, 'c2', 1)
(2, 15, '1972-10-23', 'Saint Martin', 'Kevin Erickson', None, 1, None, None, None, None, 10, 'a1', 0)
(2, 16, '2017-04-17', 'British Indian Ocean Territory (Chagos Archipelago)', 'Karen Walls', None, 0, None, None, None, None, 25, 'c2', 8)
(2, 17, '2002-10-17', 'Argentina', 'Grace Montoya', None, 1, None, None, None, None, 14, 'b1', 2)
(2, 18, '1996-12-03', 'Tuvalu', 'Eric Mcclure', None, 1, None, None, None, None, 22, 'b1', 7)
(2, 19, '1973-10-22', 'Burkina Faso', 'Danny Page', None, 0, None, None, None, None, 5, 'a1', 7)
(2, 20, '2013-08-08', 'Vanuatu', 'Ryan Ryan', None, 0, None, None, None, None, 5, 'c2', 8)
(2, 21, '2006-12-18', 'Greenland', 'Mark Owens', None, 1, None, None, None, None, 12, 'b1', 3)
(2, 22, '2005-06-03', 'Saint Lucia', 'Joseph Wagner', None, 1, None, None, None, None, 7, 'a1', 8)
(2, 23, '1979-10-27', 'Egypt', 'Brent Grant', None, 1, None, None, None, None, 12, 'b2', 8)
(2, 24, '2017-10-18', 'Ghana', 'Breanna Avila', None, 0, None, None, None, None, 28, 'b2', 9)
(2, 25, '1999-06-12', 'Malaysia', 'Nathan Moore', None, 1, None, None, None, None, 24, 'b2', 5)
(2, 26, '1983-09-14', 'Bermuda', 'Elizabeth Foster', None, 0, None, None, None, None, 23, 'b1', 9)